In [26]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Creating a Series

In [27]:
s = pd.Series([1,2,3,np.nan,5,6])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

## Creating a Data Frame 
### By passing a NumPy array

In [28]:
dates = pd.date_range('20180101', periods=6)
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

### By passing a list of objects that can be converted to series-like

In [29]:
 df2 = pd.DataFrame({ 'A' : 1., \
                     'B' : pd.Timestamp('20130102'), \
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'), \
                     'D' : np.array([3] * 4,dtype='int32'), \
                     'E' : pd.Categorical(["test","train","test","train"]), \
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

#### The columns have different types

In [30]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

### The top 'n' rows of the Data Frame

In [31]:
df.head(n=5)

                   A         B         C         D
2018-01-01 -0.125440  0.512972  1.526554  0.814111
2018-01-02  1.773555  0.180810 -1.516984 -1.295417
2018-01-03  0.105295  0.777351 -2.157885  0.647192
2018-01-04  0.554829  0.027857 -0.253668 -0.824270
2018-01-05  1.285226 -0.714544 -1.030063  1.156760

### The bottom 'n' rows of the Data Frame

In [32]:
df.tail(n=5)

                   A         B         C         D
2018-01-02  1.773555  0.180810 -1.516984 -1.295417
2018-01-03  0.105295  0.777351 -2.157885  0.647192
2018-01-04  0.554829  0.027857 -0.253668 -0.824270
2018-01-05  1.285226 -0.714544 -1.030063  1.156760
2018-01-06  1.790050 -2.529483 -0.468722  0.028549

### describe() shows a quick statistic summary of the data

In [33]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.897253 -0.290840 -0.650128  0.087821
std    0.837361  1.208488  1.272569  0.972810
min   -0.125440 -2.529483 -2.157885 -1.295417
25%    0.217679 -0.528944 -1.395254 -0.611065
50%    0.920028  0.104333 -0.749393  0.337870
75%    1.651473  0.429932 -0.307431  0.772381
max    1.790050  0.777351  1.526554  1.156760

### Transposing the data

In [34]:
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -0.125440    1.773555    0.105295    0.554829    1.285226    1.790050
B    0.512972    0.180810    0.777351    0.027857   -0.714544   -2.529483
C    1.526554   -1.516984   -2.157885   -0.253668   -1.030063   -0.468722
D    0.814111   -1.295417    0.647192   -0.824270    1.156760    0.028549

### Sorting by axis

In [35]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-01-01  0.814111  1.526554  0.512972 -0.125440
2018-01-02 -1.295417 -1.516984  0.180810  1.773555
2018-01-03  0.647192 -2.157885  0.777351  0.105295
2018-01-04 -0.824270 -0.253668  0.027857  0.554829
2018-01-05  1.156760 -1.030063 -0.714544  1.285226
2018-01-06  0.028549 -0.468722 -2.529483  1.790050

### Sorting by values

In [36]:
df.sort_values(by='D')

                   A         B         C         D
2018-01-02  1.773555  0.180810 -1.516984 -1.295417
2018-01-04  0.554829  0.027857 -0.253668 -0.824270
2018-01-06  1.790050 -2.529483 -0.468722  0.028549
2018-01-03  0.105295  0.777351 -2.157885  0.647192
2018-01-01 -0.125440  0.512972  1.526554  0.814111
2018-01-05  1.285226 -0.714544 -1.030063  1.156760

## Selection - Getting

### Selecting a single column, which yields a Series

In [42]:
df['A']
df.A

2018-01-01   -0.125440
2018-01-02    1.773555
2018-01-03    0.105295
2018-01-04    0.554829
2018-01-05    1.285226
2018-01-06    1.790050
Freq: D, Name: A, dtype: float64

### Selecting with [:] (slicing the rows)

In [43]:
df[0:3]

                   A         B         C         D
2018-01-01 -0.125440  0.512972  1.526554  0.814111
2018-01-02  1.773555  0.180810 -1.516984 -1.295417
2018-01-03  0.105295  0.777351 -2.157885  0.647192

In [44]:
df['2018-01-02':'2018-01-04']

                   A         B         C         D
2018-01-02  1.773555  0.180810 -1.516984 -1.295417
2018-01-03  0.105295  0.777351 -2.157885  0.647192
2018-01-04  0.554829  0.027857 -0.253668 -0.824270

## Selection - Selecting by label

### Getting a cross section using label

In [45]:
df.loc[dates[0]]

A   -0.125440
B    0.512972
C    1.526554
D    0.814111
Name: 2018-01-01 00:00:00, dtype: float64

### Selecting on a multi-axis by label

In [47]:
df.loc[:,['A','D']]

                   A         D
2018-01-01 -0.125440  0.814111
2018-01-02  1.773555 -1.295417
2018-01-03  0.105295  0.647192
2018-01-04  0.554829 -0.824270
2018-01-05  1.285226  1.156760
2018-01-06  1.790050  0.028549


### Adding a slice to the rows (both endpoints are included)

In [49]:
df.loc['2018-01-02':'2018-01-04', ['A', 'D']]

                   A         D
2018-01-02  1.773555 -1.295417
2018-01-03  0.105295  0.647192
2018-01-04  0.554829 -0.824270

### Reduction in the dimensions of the returned object

In [51]:
df.loc['2018-01-01', ['A', 'D']]

A   -0.125440
D    0.814111
Name: 2018-01-01 00:00:00, dtype: float64

### For getting a scalar value

In [58]:
df.loc[dates[0], 'A']

-0.12544015610641263

### Equivalent to the above method

In [59]:
df.at[dates[0], 'A']

-0.12544015610641263

## Selection - Selecting by Position

### Passing the index of the row

In [63]:
df.iloc[1]

A    1.773555
B    0.180810
C   -1.516984
D   -1.295417
Name: 2018-01-02 00:00:00, dtype: float64

### Passing a slice for the rows and a slice for the columns

In [74]:
df.iloc[1:3, 0:2]

                   A         B
2018-01-02  1.773555  0.180810
2018-01-03  0.105295  0.777351

### Passing a explicit list of rows indexes and a explicit list of columns indexes

In [77]:
df.iloc[[1,3,5], [0,3]]

                   A         D
2018-01-02  1.773555 -1.295417
2018-01-04  0.554829 -0.824270
2018-01-06  1.790050  0.028549

### Getting a value explicitly

In [79]:
df.iloc[0,0]

-0.12544015610641263

In [80]:
df.iat[0,0]

-0.12544015610641263

## Selection - Boolean indexing

### Using a single column's value to select data

In [82]:
df[df.D < 0]

                   A         B         C         D
2018-01-02  1.773555  0.180810 -1.516984 -1.295417
2018-01-04  0.554829  0.027857 -0.253668 -0.824270

### Selecting values from Data Frame where the condition is met

In [83]:
df[df < 0]

                  A         B         C         D
2018-01-01 -0.12544       NaN       NaN       NaN
2018-01-02      NaN       NaN -1.516984 -1.295417
2018-01-03      NaN       NaN -2.157885       NaN
2018-01-04      NaN       NaN -0.253668 -0.824270
2018-01-05      NaN -0.714544 -1.030063       NaN
2018-01-06      NaN -2.529483 -0.468722       NaN

### Using isin() method for filtering

In [86]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'two', 'one']

df2[df2.E.isin(['two', 'three'])]

                   A         B         C         D      E
2018-01-03  0.105295  0.777351 -2.157885  0.647192    two
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  three
2018-01-05  1.285226 -0.714544 -1.030063  1.156760    two

## Selection - Setting

### Setting a new column that automatically aligns the data by the indexes

In [89]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20180102', periods=6))

df2['F'] = s1

df2

                   A         B         C         D      E    F
2018-01-01 -0.125440  0.512972  1.526554  0.814111    one  NaN
2018-01-02  1.773555  0.180810 -1.516984 -1.295417    one  1.0
2018-01-03  0.105295  0.777351 -2.157885  0.647192    two  2.0
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  three  3.0
2018-01-05  1.285226 -0.714544 -1.030063  1.156760    two  4.0
2018-01-06  1.790050 -2.529483 -0.468722  0.028549    one  5.0

### Setting values by label

In [91]:
df2.at[dates[0], 'F'] = 0
df2

                   A         B         C         D      E    F
2018-01-01 -0.125440  0.512972  1.526554  0.814111    one  0.0
2018-01-02  1.773555  0.180810 -1.516984 -1.295417    one  1.0
2018-01-03  0.105295  0.777351 -2.157885  0.647192    two  2.0
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  three  3.0
2018-01-05  1.285226 -0.714544 -1.030063  1.156760    two  4.0
2018-01-06  1.790050 -2.529483 -0.468722  0.028549    one  5.0

### Setting values by postion

In [92]:
df2.iat[0,1] = 0
df2

                   A         B         C         D      E    F
2018-01-01 -0.125440  0.000000  1.526554  0.814111    one  0.0
2018-01-02  1.773555  0.180810 -1.516984 -1.295417    one  1.0
2018-01-03  0.105295  0.777351 -2.157885  0.647192    two  2.0
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  three  3.0
2018-01-05  1.285226 -0.714544 -1.030063  1.156760    two  4.0
2018-01-06  1.790050 -2.529483 -0.468722  0.028549    one  5.0

### Setting values passing a NumPy array

In [95]:
df2.loc[:, 'D'] = np.array([5] * len(df2))
df2

                   A         B         C  D      E    F
2018-01-01 -0.125440  0.000000  1.526554  5    one  0.0
2018-01-02  1.773555  0.180810 -1.516984  5    one  1.0
2018-01-03  0.105295  0.777351 -2.157885  5    two  2.0
2018-01-04  0.554829  0.027857 -0.253668  5  three  3.0
2018-01-05  1.285226 -0.714544 -1.030063  5    two  4.0
2018-01-06  1.790050 -2.529483 -0.468722  5    one  5.0

### A where statement with assignment

In [96]:
df2[df2.F < 2] = 4
df2

                   A         B         C  D      E    F
2018-01-01  4.000000  4.000000  4.000000  4      4  4.0
2018-01-02  4.000000  4.000000  4.000000  4      4  4.0
2018-01-03  0.105295  0.777351 -2.157885  5    two  2.0
2018-01-04  0.554829  0.027857 -0.253668  5  three  3.0
2018-01-05  1.285226 -0.714544 -1.030063  5    two  4.0
2018-01-06  1.790050 -2.529483 -0.468722  5    one  5.0

## Missing Data

It's important to remember that Pandas doesn't include NaN in computations.

For more: https://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data

### Reindexing

It allows you to change/add/delete the index on specified axis (this returns a copy of the data).

In [99]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2018-01-01 -0.125440  0.512972  1.526554  0.814111  1.0
2018-01-02  1.773555  0.180810 -1.516984 -1.295417  1.0
2018-01-03  0.105295  0.777351 -2.157885  0.647192  NaN
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  NaN

### Drop any row that have missing data

In [101]:
df1.dropna(how='any')
df1

                   A         B         C         D    E
2018-01-01 -0.125440  0.512972  1.526554  0.814111  1.0
2018-01-02  1.773555  0.180810 -1.516984 -1.295417  1.0
2018-01-03  0.105295  0.777351 -2.157885  0.647192  NaN
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  NaN

### Filling missing data

In [112]:
df1.fillna(value=5)

                   A         B         C         D    E
2018-01-01 -0.125440  0.512972  1.526554  0.814111  1.0
2018-01-02  1.773555  0.180810 -1.516984 -1.295417  1.0
2018-01-03  0.105295  0.777351 -2.157885  0.647192  5.0
2018-01-04  0.554829  0.027857 -0.253668 -0.824270  5.0

### Getting the boolean value for each value where values are NaN

In [113]:
pd.isna(df1)

                A      B      C      D      E
2018-01-01  False  False  False  False  False
2018-01-02  False  False  False  False  False
2018-01-03  False  False  False  False   True
2018-01-04  False  False  False  False   True

## Operations - Stats

### Performing a descriptive statistic over the columns

In [114]:
df.mean()

A    0.897253
B   -0.290840
C   -0.650128
D    0.087821
dtype: float64

### Performing a descriptive statistic over the rows (the other axis)

In [115]:
df.mean(axis=1)

2018-01-01    0.682049
2018-01-02   -0.214509
2018-01-03   -0.157012
2018-01-04   -0.123813
2018-01-05    0.174345
2018-01-06   -0.294901
Freq: D, dtype: float64

### Operating with objects with different dimensions and need alignment

In addition, Pandas, broadcasts along the specified dimension

In [116]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2018-01-01    NaN
2018-01-02    NaN
2018-01-03    1.0
2018-01-04    3.0
2018-01-05    5.0
2018-01-06    NaN
Freq: D, dtype: float64

In [117]:
df.sub(s, axis='index')

                   A         B         C         D
2018-01-01       NaN       NaN       NaN       NaN
2018-01-02       NaN       NaN       NaN       NaN
2018-01-03 -0.894705 -0.222649 -3.157885 -0.352808
2018-01-04 -2.445171 -2.972143 -3.253668 -3.824270
2018-01-05 -3.714774 -5.714544 -6.030063 -3.843240
2018-01-06       NaN       NaN       NaN       NaN

## Operations - Apply

### Applying functions to the data

In [118]:
df.apply(np.cumsum)

                   A         B         C         D
2018-01-01 -0.125440  0.512972  1.526554  0.814111
2018-01-02  1.648115  0.693782  0.009570 -0.481306
2018-01-03  1.753411  1.471133 -2.148316  0.165886
2018-01-04  2.308240  1.498990 -2.401983 -0.658384
2018-01-05  3.593466  0.784446 -3.432047  0.498376
2018-01-06  5.383516 -1.745037 -3.900769  0.526925

In [119]:
df.apply(lambda x: x.max() - x.min())

A    1.915490
B    3.306834
C    3.684439
D    2.452177
dtype: float64

## Operations - Histogramming

For more: https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization

In [120]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    1
1    0
2    3
3    5
4    0
5    2
6    0
7    6
8    1
9    4
dtype: int64

In [121]:
s.value_counts()

0    3
1    2
6    1
5    1
4    1
3    1
2    1
dtype: int64

## Operations - Strings

### Series is equipped with a set of string processing methods in the str attribute

For more: https://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods

In [124]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Operations - Merge

### Concat

In [125]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.283574  0.870948  0.133735  1.081054
1 -0.091543  1.108356  0.370183  0.160491
2  1.991553 -0.939535 -1.024471  0.566371
3  1.328932  0.697647  0.419787  0.447648
4  0.599141 -0.894090 -0.542404  0.091969
5  0.728337  0.120314  1.726839 -0.099372
6 -1.064251  0.851809 -0.548926 -0.238915
7  0.801199 -1.661912 -0.680726 -1.260176
8 -0.658434  0.123753 -0.366547  0.257343
9  0.658817 -0.639239  1.973414 -0.009750

In [126]:
pieces = [df[0:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.283574  0.870948  0.133735  1.081054
 1 -0.091543  1.108356  0.370183  0.160491
 2  1.991553 -0.939535 -1.024471  0.566371,
           0         1         2         3
 3  1.328932  0.697647  0.419787  0.447648
 4  0.599141 -0.894090 -0.542404  0.091969
 5  0.728337  0.120314  1.726839 -0.099372
 6 -1.064251  0.851809 -0.548926 -0.238915,
           0         1         2         3
 7  0.801199 -1.661912 -0.680726 -1.260176
 8 -0.658434  0.123753 -0.366547  0.257343
 9  0.658817 -0.639239  1.973414 -0.009750]

In [127]:
pd.concat(pieces)

          0         1         2         3
0 -0.283574  0.870948  0.133735  1.081054
1 -0.091543  1.108356  0.370183  0.160491
2  1.991553 -0.939535 -1.024471  0.566371
3  1.328932  0.697647  0.419787  0.447648
4  0.599141 -0.894090 -0.542404  0.091969
5  0.728337  0.120314  1.726839 -0.099372
6 -1.064251  0.851809 -0.548926 -0.238915
7  0.801199 -1.661912 -0.680726 -1.260176
8 -0.658434  0.123753 -0.366547  0.257343
9  0.658817 -0.639239  1.973414 -0.009750

### Join

For more: https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join

In [129]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [130]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append

For more: https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation

In [132]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.632994  0.364632 -0.921828  0.719537
1  0.303764 -1.408569 -1.220675  0.972319
2 -0.686459  1.392914 -0.543101  0.110364
3 -0.267655  0.090063  0.617582  2.763763
4 -1.594256  1.662635  0.705521  0.071534
5  0.529122  0.414985  0.628192  0.410574
6 -0.876685  0.025554  0.693515 -0.400426
7 -0.370999 -0.602629 -0.930159 -0.765794

In [134]:
s = df.iloc[0]

df.append(s, ignore_index=True)

          A         B         C         D
0 -0.632994  0.364632 -0.921828  0.719537
1  0.303764 -1.408569 -1.220675  0.972319
2 -0.686459  1.392914 -0.543101  0.110364
3 -0.267655  0.090063  0.617582  2.763763
4 -1.594256  1.662635  0.705521  0.071534
5  0.529122  0.414985  0.628192  0.410574
6 -0.876685  0.025554  0.693515 -0.400426
7 -0.370999 -0.602629 -0.930159 -0.765794
8 -0.632994  0.364632 -0.921828  0.719537

### Grouping

By group by we are referring to a process involving one or more of the following steps:
    - Splitting the data into groups based on some criteria
    - Applying a function to each group independently
    - Combining the results into a data structure

For more: https://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby

In [135]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'], \
                   'B' : ['one', 'one', 'two', 'three', \
                          'two', 'two', 'one', 'three'], \
                   'C' : np.random.randn(8), \
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.391472 -0.485520
1  bar    one -0.055691 -0.799950
2  foo    two -0.876915  1.148851
3  bar  three -0.263633 -0.817089
4  foo    two -0.234739  0.696351
5  bar    two  0.027474  0.688712
6  foo    one -0.670330  1.328024
7  foo  three  0.072584 -1.502941

In [138]:
df.groupby('A').sum()

            C         D
A
bar -0.291850 -0.928327
foo -0.317928  1.184764

In [141]:
df.groupby(['A', 'B']).count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2